// Самооценка:
const headerStyle = 'font-weight: bold; font-size: 28px; color: gray;';
const subheaderStyle = 'font-weight: bold; font-size: 18px; color: #6d6d6d;'

const alertStyle = 'font-weight: bold; font-size: 30px; color: red;';

console.log('%c Самооценка 120 / 120:', headerStyle);

console.log('✔ засабмитил в rs app ссылку на своё CV, задеплоенное на gh-pages +10');
console.log('✔ вёрстка валидная +10');
console.log('✔ вёрстка семантическая +20');
console.log('  - header, main, footer +5');
console.log('  - элемент nav +5');
console.log('  - заголовки h2 +5');
console.log('✔ в footer есть ссылка на гитхаб автора работы, год создания приложения, логотип курса со ссылкой на курс +10');
console.log('✔ для оформления СV используются css-стили +10');
console.log('✔ при уменьшении масштаба страницы браузера вёрстка размещается по центру по горизонтали, а не сдвигается в сторону +10');
console.log('✔ на странице СV есть фото или аватарка автора, пропорции изображения не искажены, у изображения есть атрибут alt +10');
console.log('✔ навигация, контакты для связи и перечень навыков оформлены в виде списка ul > li или ul > li > a +10');
console.log('✔ содержание CV +30');
console.log('  - краткую информацию о себе +5');
console.log('  - контакты для связи +5');
console.log('  - перечень навыков +5');
console.log('  - пример кода. Код добавляется при помощи символов и тегов, а не картинкой +5');
console.log('  - перечень выполненных учебных проектов со ссылками на исходный код или страницу приложения +5');
console.log('  - информацию об образовании и уровне английского +5');
console.log('✔ CV выполнено на английском языке +10');