// Самооценка:
const headerStyle = 'font-weight: bold; font-size: 28px; color: gray;';
const subheaderStyle = 'font-weight: bold; font-size: 18px; color: #6d6d6d;'

const alertStyle = 'font-weight: bold; font-size: 30px; color: red;';

console.log('%c Самооценка 140 / 150:', headerStyle);

console.log('✔ - вёрстка валидная +10');
console.log('✔ - вёрстка семантическая +20');
console.log('   В коде страницы присутствуют следующие семантические теги HTML5: (24 балла)');
console.log('   - header +2;');
console.log('   - nav +2;');
console.log('   - main +2;');
console.log('   - section +2;');
console.log('   - h1 +2;');
console.log('   - h2 +2;');
console.log('   - h3 +2;');
console.log('   - h4 +2;');
console.log('   - em +2;');
console.log('   - code +2;');
console.log('   - article +2;');
console.log('   - footer +2;');
console.log('✔ - для оформления СV используются css-стили +10');
console.log('✔ - контент размещается в блоке, который горизонтально центрируется на странице. Фоновый цвет, если он есть, тянется во всю ширину страницы +10');
console.log('✔ - вёрстка адаптивная +10');
console.log('✔ - есть адаптивное бургер-меню, при кликах по пунктам меню реализована плавная прокрутка по якорям +10');
console.log('✔ - на странице СV присутствует изображение - фото +10');
console.log('✔ - контакты для связи и перечень навыков оформлены в виде списка ul > li +10');
console.log('✔ - CV содержит контакты для связи, краткую информацию о себе, перечень навыков, информацию об образовании и уровне английского +10');
console.log('✔ - CV содержит пример кода с подсветкой кода +10');
console.log('✔ - CV содержит изображения-ссылки на выполненные проекты, у каждого проекта есть название, небольшое описание, указан перечень используемых технологий +10');
console.log('✔ - CV выполнено на английском языке +10');
console.log('✔ - выполнены требования к Pull Request +10');
console.log('❌ - есть видеорезюме автора CV на английском языке');
console.log('❓ - дизайн, оформление, качество выполнения CV не ниже чем в примерах CV, приведённых в материалах к заданию');
